
var dom = document.getElementById("pic1");
var myChart1 = echarts.init(dom);
var time = [
["1922","1","14"],
["1935","1","0"],
["1936","4","0"],
["1937","2","3"],
["1938","2","14"],
["1939","3","4"],
["1940","4","9"],
["1941","11","8"],
["1942","3","16"],
["1943","15","53"],
["1944","16","39"],
["1945","12","25"],
["1946","9","99"],
["1947","5","89"],
["1948","4","57"],
["1949","2","3"],
["1954","3","5"],
["1958","1","14"],
["1961","1","15"],
["1966","2","0"],
["1967","1","16"],
["1968","1",""],
["1969","1",""],
["1970","2","0"],
["1971","1","9"],
["1973","2","29"],
["1976","1","40"],
["1977","1",""],
["1979","1","0"],
["1980","1","26"],
["1982","3","137"],
["1983","3","11"],
["1984","1","0"],
["1985","2","38"],
["1986","1","6"],
["1987","1","0"],
["1988","4","115"],
["1989","3","35"],
["1990","5","128"],
["1992","4","262"],
["1993","17","72"],
["1994","6","160"],
["1995","1","0"],
["1996","3","2"],
["1997","4","36"],
["1998","2","0"],
["1999","5","61"],
["2000","3","1"],
["2001","2","8"],
["2002","7","244"],
["2003","3","0"],
["2004","2","0"],
["2005","1","0"],
["2006","2","42"],
["2008","2","3"],
["2009","1","0"],
["2010","1","44"],
["2011","2","3"],
["2012","1","2"],
["2013","3","1"],
["2014","1","0"],
["2015","2","0"],
["2016","1","5"],
["2018","4","12"],

]
var app = {};
option = {
    backgroundColor: '#f7f7f7',
        title: {
            text: '',
            x: 'left'
        },
        tooltip: {
            trigger: 'axis'
        },
        legend: {
            data:['航空事故数','总伤亡人数'],
            x: 'right'
        },
        xAxis: {
            data: time.map(function (item) {
                return item[0];
            }),
            axisPointer: {
                type: 'shadow'
            }
        },
        yAxis:  [
        {
            type: 'value',
            name: '航空事故数',
            min: 0,
            axisLabel: {
                formatter: '{value} 件'
            }
        },
        {
            type: 'value',
            name: '总伤亡人数',
            min: 0,
            axisLabel: {
                formatter: '{value} 人'
            }
        }
    ],
    dataZoom: [{
            startValue: '1942',
            endValue:'1996'
    }, {
        type: 'inside'
    }],
        series: [
        {
            name:'航空事故数',
            type:'line',
            data: time.map(function (item) {
				return item[1];
            }),
            color:'#e3c4a8',
            //symbol:'star',//拐点样式
            symbolSize: 8,//拐点大小
            smooth:0.3,
            lineStyle:{
                width:4//设置线条粗细
            }
        },
        {
            name: '总伤亡人数',
            type: 'bar',
            yAxisIndex: 1,
            data: time.map(function (item) {
				return item[2];
			}),
            itemStyle: {
                normal: {
                    color: new echarts.graphic.LinearGradient(0,0,0,1,[
                    {offset: 0, color: '#4592af'},
                    {offset: 1, color: '#33313b'}
                    ])
                }
            },
            large:true
        }
    ]
    };;
    myChart1.setOption(option);